In [2]:
import numpy as np ,pandas as pd  #importing files required for this assignemt

In [88]:
# Problem Statment

# It happens all the time: someone gives you data containing malformed strings,Python,lists and missing data.
# How do you tidy it up so you can get on with the analysis?

# Take this monstrosity as the DataFrame to use in the following puzzles:

# df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',
# 'Budapest_PaRis', 'Brussels_londOn'],
# 'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
# 'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
# 'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
# '12. Air France', '"Swiss Air"']})

In [248]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [249]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [250]:
# Q 1. Some values in the the FlightNumber column are missing. These numbers are meant
# to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in
# these missing numbers and make the column an integer column (instead of a float
# column).

In [251]:
# we can use fillna method or interpolate as here we have to fill the nan values as equally spwced difference of 10

In [252]:
df['FlightNumber'].interpolate(inplace=True)#first interpolating the series 
#converting the float values into the integer values
df['FlightNumber']=df['FlightNumber'].astype(int)#after converting the values we are agin saving it i the origina ldataframe
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [253]:
# Q 2. The From_To column would be better as two separate columns! Split each string on
# the underscore delimiter _ to give a new temporary DataFrame with the correct values.
# Assign the correct column names to this temporary DataFrame.

In [254]:
#using the split func
l=[]
for i in range(len(df)):
    l.append(df['From_To'].iloc[i].split('_'))
l
From=list()
To=list()
for i in range(len(l)): 
    From.append(l[i][0]) 
    To.append(l[i][1])  
        
df_Temp=pd.DataFrame(df)
df_Temp.rename(columns={'From_To':'From'},inplace=True)
df_Temp['From']=From
df_Temp.insert(loc=1,value=pd.Series(To),column='To')

In [238]:
df_Temp

       From         To  FlightNumber  RecentDelays              Airline
0    LoNDon      paris         10045      [23, 47]               KLM(!)
1    MAdrid      miLAN         10055            []    <Air France> (12)
2    londON  StockhOlm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      PaRis         10075          [13]       12. Air France
4  Brussels     londOn         10085      [67, 32]          "Swiss Air"

In [239]:
# Q3. Notice how the capitalisation of the city names is all mixed up in this temporary
# DataFrame. Standardise the strings so that only the first letter is uppercase (e.g.
# "londON" should become "London".)

In [255]:
for i in range(len(df_Temp)):
    df_Temp['From'].iloc[i]=df_Temp['From'].iloc[i].capitalize()
    df_Temp['To'].iloc[i]=df_Temp['To'].iloc[i].capitalize()

C:\Users\Abhi\Anaconda3\lib\site-packages\pandas\core\indexing.py:189: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

In [256]:
df_Temp

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []    <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris         10075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]          "Swiss Air"

In [257]:
# Q4. Delete the From_To column from df and attach the temporary DataFrame from the
# previous questions.

In [264]:
df.drop(columns='From_To',inplace=True)

In [269]:
df.insert(0,column='From',value=df_Temp['From'])

In [270]:
df

       From  FlightNumber  RecentDelays              Airline
0    London         10045      [23, 47]               KLM(!)
1    Madrid         10055            []    <Air France> (12)
2    London         10065  [24, 43, 87]  (British Airways. )
3  Budapest         10075          [13]       12. Air France
4  Brussels         10085      [67, 32]          "Swiss Air"

In [271]:
# Q5. In the RecentDelays column, the values have been entered into the DataFrame as a
# list. We would like each first value in its own column, each second value in its own
# column, and so on. If there isn't an Nth value, the value should be NaN.

# Expand the Series of lists into a DataFrame named delays, rename the columns delay_1,
# delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [301]:
# l=[]
# for i in range(len(df)):
#     longestListlen=None
#     longestListlen=len(df['RecentDelays'].iloc[i])
#     l.append(longestListlen)
#     l.sort(reverse=True)

In [321]:
k=[]
for i in range(len(df)):
    l=[]
    l=df['RecentDelays'].iloc[i]
    k.append(l)
noofCol=max(len(l) for l in k)  
listKey=['delay'+'_' +str(i) for i in range(noofCol)]
# listvalue=[for list in k for i in k ]
# dict(zip())

In [324]:
listKey

['delay_0', 'delay_1', 'delay_2']

['delay_0', 'delay_1', 'delay_2']